{
  "命宮主星詳解": {
    "紫微": {
      "基本性格": "你是天生的領導者，有帝王般的氣場。個性厚道正直，不喜歡與人計較小事。外表給人一種威嚴感，說話有份量，別人自然會聽從你的意見。",
      "有輔弼": "紫微得左輔右弼輔佐，這是大貴之格！你不只有領導能力，還有得力助手相助。一生中會遇到願意幫你的貴人，事業上可以做到很高的位置。",
      "無輔弼": "紫微單守，雖然有帝王的才華，但容易感到孤獨。身邊缺乏真正的知己，做事常常要自己扛。建議多培養團隊，不要凡事一個人硬撐。",
      "適合職業": "適合當老闆、高階主管、政府官員、大企業領導人。你是坐鎮指揮的人，不適合當基層員工。",
      "感情提醒": "你對感情的標準很高，另一半必須讓你尊重才行。不喜歡太黏人的伴侶，需要保有自己的空間。"
    },
    "天機": {
      "基本性格": "你頭腦靈活，反應極快，是十四主星中最聰明的。思考事情很有邏輯，擅長分析和策劃。但有時想太多，容易鑽牛角尖。",
      "適合職業": "適合公務員、教師、企劃、顧問、銀行業、資訊業。需要用腦的工作都適合你。",
      "感情提醒": "你在感情上比較理性，有時會過度分析對方的一舉一動。建議放輕鬆，感情不是數學題，不需要每件事都算得那麼清楚。",
      "財運特點": "你的財運屬於穩定型，適合領固定薪水。投機取巧的事不適合你，老老實實工作反而能累積財富。"
    },
    "太陽": {
      "基本性格": "你個性開朗、熱情大方，像太陽一樣照耀身邊的人。為人正直，有正義感，看不慣不公平的事。",
      "男命": "男命太陽入命，主事業心強。你會把很多精力放在工作上，希望在社會上有一番成就。適合軍警、外交、法官、政治等需要公眾形象的工作。",
      "女命": "女命太陽代表你生命中的男人——父親、丈夫、兒子。太陽廟旺，這些男人對你都不錯；太陽落陷，可能要多操心他們的事。",
      "入廟": "太陽入廟，光芒四射！你的貴人運很強，到哪裡都有人願意幫你。事業上容易被看見、被提拔。",
      "落陷": "太陽落陷，光芒被遮住。你需要比別人更努力才能出頭，但不代表不會成功，只是過程比較辛苦。"
    },
    "武曲": {
      "基本性格": "你是標準的實幹家，個性剛毅果斷，說一不二。做事講求效率，不喜歡拖泥帶水。脾氣比較急，但發完就沒事了。",
      "財運特點": "武曲是財星之王！你天生對錢敏感，理財能力強。適合從事金融、財務、會計相關工作。有賺大錢的本事。",
      "適合職業": "財務、金融、軍警、武術、運動員、外科醫生。需要果斷決策或體力的工作都適合。",
      "感情提醒": "你在感情上比較木訥，不太會說甜言蜜語。另一半需要理解你是用行動表達愛，而不是用嘴巴。"
    },
    "天同": {
      "基本性格": "你是十四主星中最有福氣的！個性溫和善良，人緣極好，到哪裡都受歡迎。不喜歡與人爭，凡事退一步海闊天空。",
      "財運特點": "你的財運屬於細水長流型。不會大富大貴，但也不會缺錢用。知足常樂是你的人生哲學。",
      "適合職業": "適合服務業、社工、教育、藝術、宗教等需要愛心和耐心的工作。",
      "感情提醒": "你對感情很認真，是顧家的好伴侶。但要注意不要太軟弱，有時候該堅持的還是要堅持。"
    },
    "廉貞": {
      "基本性格": "你外表斯文，但內心有一股傲氣。個性倔強，認定的事很難改變。有藝術天份，審美觀很好。",
      "桃花運": "廉貞是次桃花星，你天生有異性緣。長相通常清秀，眼神迷人。但要注意感情上不要太花心。",
      "適合職業": "適合藝術、設計、公關、演藝、軍警。需要創意或魅力的工作都適合。",
      "注意事項": "廉貞最怕遇到七殺、破軍、貪狼，組合不好會有意外之災。如果你的命盤有這種組合，做事要特別小心。"
    },
    "天府": {
      "基本性格": "你是南斗的君主，個性穩重保守，做事有條有理。不喜歡冒險，凡事求穩。心眼比較多，但都是用在正途。",
      "財運特點": "天府守財能力強，你不會亂花錢，懂得理財。但賺錢能力普通，需要靠時間慢慢累積。",
      "適合職業": "適合文職、行政、財務、教育、公務員。需要穩定和細心的工作都適合。",
      "感情提醒": "你對感情很忠誠，但有時太過保守。另一半可能會覺得你不夠浪漫，適時製造一些小驚喜會更好。"
    },
    "太陰": {
      "基本性格": "你個性溫柔細膩，心思敏感，富有同情心。喜歡安靜的環境，不太喜歡太吵雜的場合。有藝術天份，對美的事物特別有感覺。",
      "女命": "女命太陰入命，主漂亮！尤其在子、丑、亥宮，長相特別出眾。你的氣質溫婉，很受異性歡迎。",
      "男命": "男命太陰代表你生命中的女人——母親、妻子。太陰廟旺，她們對你很好；落陷則可能需要多照顧她們。",
      "財運特點": "太陰是正財星，你的財運來自穩定的收入，不適合投機。適合從事文職、藝術、服務業。",
      "入廟": "太陰入廟（子、丑、亥宮），各方面都很順利，尤其財運和感情運都不錯。",
      "落陷": "太陰落陷，情緒容易波動，做事比較辛苦。但只要調整好心態，還是能有所成就。"
    },
    "貪狼": {
      "基本性格": "你是十四主星中慾望最強的！對人生有很多追求——錢、名、利、色，你都想要。精力旺盛，興趣廣泛，但有時不夠專注。",
      "在亥子宮": "貪狼在亥、子宮（水宮）是正桃花星，異性緣超強！但要注意不要沉迷於酒色財氣，否則會誤了正事。",
      "在其他宮": "貪狼在其他宮位是武官星，反而適合從事軍警、業務、演藝等需要衝勁的工作。",
      "財運特點": "你有賺大錢的野心和能力，但財來財去，守財能力較弱。建議賺到錢就存起來，不要全部花掉。",
      "感情提醒": "你對感情的新鮮感追求很強，容易見異思遷。結婚後要收心，否則容易出問題。"
    },
    "巨門": {
      "基本性格": "你口才很好，能言善道，但有時說話太直接會得罪人。個性比較多疑，容易想太多。做事認真負責，但也容易給自己太大壓力。",
      "適合職業": "適合律師、老師、業務、主持人、評論員。需要用嘴巴吃飯的工作都適合。",
      "財運特點": "你的財運要靠自己打拼，祖業幫助不大。白手起家的機會很高。",
      "感情提醒": "你在感情上容易吃醋、猜疑，這會讓另一半很有壓力。建議多一點信任，少一點質問。"
    },
    "天相": {
      "基本性格": "你是天生的輔佐人才，個性溫和厚道，做事細心負責。不喜歡出風頭，但能力很強。當別人的左右手，你最稱職。",
      "女命最佳": "女命天相入命是最好的！你賢慧能幹，既能持家又能幫助老公事業，是標準的賢內助。",
      "適合職業": "適合秘書、助理、幕僚、人資、行政。輔助性質的工作最能發揮你的長才。",
      "感情提醒": "你對感情很忠誠，但有時太過遷就對方。記得保有自己的原則，不要什麼都順著對方。"
    },
    "天梁": {
      "基本性格": "你是天生的保護者，個性正直剛強，有俠義之心。看到不平的事會想管，別人有困難你會想幫。長輩緣很好，容易得到長輩提拔。",
      "適合職業": "適合公務員、醫生、律師、社工、宗教。需要幫助別人或伸張正義的工作都適合。",
      "財運特點": "你不太在意錢，覺得夠用就好。這種心態反而讓你一生不缺錢，但也不會大富大貴。",
      "感情提醒": "你在感情上比較傳統，喜歡穩定的關係。另一半如果太前衛，你可能會不習慣。"
    },
    "七殺": {
      "基本性格": "你個性剛烈，敢作敢當，是天生的將軍之才。做事果斷有魄力，不喜歡拖拖拉拉。脾氣比較急，得罪人也不在乎。",
      "男命": "男命七殺入命非常好！適合從事軍警、運動、競爭性強的行業。你有開創事業的能力和膽識。",
      "女命": "女命七殺入命，個性太強，在感情上容易吃虧。另一半可能會受不了你的脾氣。建議學著溫柔一點。",
      "適合職業": "適合軍警、運動員、創業者、業務主管。需要衝勁和魄力的工作都適合。",
      "財運特點": "你的財運起伏較大，大起大落。適合靠自己打拼，不適合守成。"
    },
    "破軍": {
      "基本性格": "你是天生的開創者，喜歡打破現狀、創造新局。個性獨立，不喜歡被束縛。做事有衝勁，但有時太過衝動。",
      "男命": "男命破軍入命，適合開疆闢土的工作。創業、業務、軍警都適合你。但要注意不要太躁進。",
      "女命": "女命破軍入命，個性比較孤僻，晚婚的機率較高。在感情上要學著妥協，不要太堅持己見。",
      "適合職業": "適合創業、研發、設計、軍警。需要創新或破壞的工作都適合。",
      "財運特點": "你的財運屬於先破後成型。年輕時可能比較辛苦，但中年以後會越來越好。"
    }
  },
  "四化深入解讀": {
    "化祿": {
      "命宮": "化祿入命，你一生財祿不缺！做什麼事都容易有收穫，是有福氣的命。",
      "財帛宮": "化祿入財帛宮是最好的！你的財源廣進，賺錢對你來說不是難事。適合從商或投資。",
      "官祿宮": "化祿入官祿宮，事業運很順！工作上容易得到賞識和升遷，仕途順暢。",
      "夫妻宮": "化祿入夫妻宮，感情運不錯！容易找到對你好的另一半，婚姻生活幸福。",
      "遷移宮": "化祿入遷移宮，在外發展有利！出外有貴人相助，適合到外地工作或做生意。",
      "父母宮": "化祿入父母宮，祖上有產業！你可以得到家族的庇蔭，不用從零開始。"
    },
    "化權": {
      "命宮": "化權入命，你個性剛強，有領導慾望。做事有主見，不喜歡被人指揮。",
      "財帛宮": "化權入財帛宮，你一定會自己當老闆！掌控財務的慾望很強，打工不適合你。",
      "官祿宮": "化權入官祿宮是最佳配置！你的事業會很有成就，有機會當主管或老闆。",
      "夫妻宮": "化權入夫妻宮，另一半個性比較強勢。你們的相處需要多一點包容。"
    },
    "化科": {
      "命宮": "化科入命，你有才華、有名氣！適合從事需要專業的工作，會受人尊敬。",
      "官祿宮": "化科入官祿宮，適合考公職或從事專業工作！考試運不錯，容易金榜題名。",
      "財帛宮": "化科入財帛宮，你靠專業技術賺錢。適合當醫生、律師、會計師等專業人士。"
    },
    "化忌": {
      "命宮": "化忌入命，你的人生會比較辛苦。但這不代表不會成功，只是需要比別人更努力。",
      "財帛宮": "化忌入財帛宮，財運有阻礙。賺錢比較辛苦，要特別注意理財，不要亂投資。",
      "官祿宮": "化忌入官祿宮，事業上容易遇到挫折。但換個角度想，這些挫折會讓你更成熟。",
      "夫妻宮": "化忌入夫妻宮，感情路比較坎坷。可能會經歷分手或婚姻問題，要特別經營感情。",
      "遷移宮": "化忌入遷移宮沖命宮，這是很凶的配置！做事要特別小心，不要太衝動。建議多積德行善。",
      "子女宮": "化忌入子女宮，與子女的緣份較薄。可能晚生育，或者跟子女的關係需要多經營。",
      "福德宮": "化忌入福德宮，你的內心容易不安。建議培養信仰或興趣來安定心神。"
    }
  },
  "發財組合詳解": {
    "祿馬交馳": "祿存和天馬同宮或對照，這是發大財的組合！你有機會賺到很多錢，尤其在外地發展更有利。愈動愈有財，不要宅在家裡。",
    "化祿天馬": "化祿遇天馬，財運來得快！把握機會，該投資就投資，該創業就創業。",
    "扶轝馬": "天馬與紫微或天府同宮，叫做「扶轝馬」，官運亨通！適合從政或在大企業發展。",
    "財馬": "天馬與太陰、武曲、天府或化祿同宮，叫做「財馬」，財源廣進！你天生有賺錢的機會。",
    "雄馬": "天馬與太陽同宮，叫做「雄馬」，早年成功！年輕時就有機會出頭。",
    "雌馬": "天馬與太陰同宮，叫做「雌馬」，財源穩定！適合穩紮穩打的理財方式。",
    "火貪格": "貪狼遇火星，這是武貴格！你可以靠自己的拼勁闖出一片天，適合創業或競爭性強的行業。",
    "財星入財帛": "財星（武曲、貪狼、祿存、化祿）入財帛宮，財運基礎很好！你天生就有賺錢的命。"
  },
  "天馬凶象詳解": {
    "死馬": "天馬與地空同宮，叫做「死馬」。做事容易無力，奔波卻沒有成果。建議腳踏實地，不要好高騖遠。",
    "折足馬": "天馬與陀羅同宮，叫做「折足馬」或「絆腳馬」。勞而無功，事倍功半。建議做事要有規劃，不要瞎忙。",
    "戰馬": "天馬與火星或鈴星同宮，叫做「戰馬」。有開拓精神但容易蠻幹，做事太衝動。建議三思而後行。",
    "是非馬": "天馬與化忌同宮，叫做「是非馬」。是非困擾多，容易惹麻煩。建議低調行事，謹言慎行。",
    "空亡馬": "天馬與地空、地劫同宮，叫做「空亡馬」。一生奔波無成，白忙一場。建議多行善積德，培養實力。"
  },
  "危險組合詳解": {
    "廉貞七殺": "廉貞和七殺同宮，古書說「路上埋屍」。這代表你要特別注意人身安全，不要做危險的事。如果星曜廟旺，凶處藏吉，反而會有意外的好運。",
    "廉貞破軍": "廉貞和破軍同宮或對照，古書說「水中做塚」。出行要特別小心水邊，不要從事水上活動。",
    "廉貞貪狼落陷": "廉貞和貪狼都落陷，這是很凶的組合。你要特別注意健康和情緒，不要鑽牛角尖。",
    "化忌沖命": "化忌在遷移宮沖命宮，這叫「半空折翅」。你的人生會有很大的起伏，中年前要特別小心。建議多做善事來化解。"
  },
  "婚姻詳解": {
    "男命看盤": "男命婚姻先看夫妻宮的星曜，再看福德宮。夫妻宮有吉星，另一半條件好；有凶星，感情路比較坎坷。",
    "女命看盤": "女命婚姻最重要是看福德宮！這是倪師特別強調的。福德宮好，嫁得好；福德宮不好，婚姻要多經營。",
    "左輔右弼單守": "左輔或右弼單獨在夫妻宮，主二婚。不是你離婚就是對方離過婚。但這不一定是壞事，二婚可能更幸福。",
    "破軍入夫妻": "破軍入夫妻宮或福德宮，婚姻會有波折。可能會經歷分手、離婚，或者另一半個性比較難相處。",
    "桃花星入夫妻": "桃花星（紅鸞、天喜、貪狼、廉貞）入夫妻宮，感情生活豐富。但要注意不要太花心，否則會影響婚姻。",
    "破解方法": "如果婚姻有凶象，可以找年紀差距大的對象（差7歲以上），或者找離過婚的人，這樣反而會比較順利。"
  }
}
